<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"cb9689e9cd5550c9924a41b417f85683bfa0a3fbebcb8e2cf9a47f8a114fa283","plan_job_ref":"Job Create terraform plan #18 at https://github.com/kvngls/terraform-workflow-prototype/actions/runs/5072779776","plan_hash":"c6e411bd65e5cae8a039c69ab1a9214323cf2a21e661c278be3d68814e344a4a","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.instance-1 will be created
  + resource "google_compute_instance" "instance-1" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + enable_display       = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + labels               = {
          + "goog-ec-src" = "vm_add-tf"
        }
      + machine_type         = "e2-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "instance-1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = "instance-1"
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/debian-cloud/global/images/debian-11-bullseye-v20230509"
              + labels = (known after apply)
              + size   = 10
              + type   = "pd-balanced"
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "projects/eastern-flight-387717/regions/us-central1/subnetworks/default"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "PREMIUM"
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = "MIGRATE"
          + preemptible         = false
          + provisioning_model  = "STANDARD"
        }

      + service_account {
          + email  = "435430647019-compute@developer.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring.write",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
              + "https://www.googleapis.com/auth/trace.append",
            ]
        }

      + shielded_instance_config {
          + enable_integrity_monitoring = true
          + enable_secure_boot          = false
          + enable_vtpm                 = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Apply terraform plan #7](https://github.com/kvngls/terraform-workflow-prototype/actions/runs/5072787645)